load-test.yml
execution:
  - concurrency: 10
    ramp-up: 1m
    hold-for: 5m
    scenario: main_scenario

scenarios:
  main_scenario:
    requests:
      - http://example.com
      - http://example.com/about
      - http://example.com/contact

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: report.xml

modules:
  jmeter:
    path: /opt/jmeter
    version: 5.6.3
    detect-plugins: false
    
  blazemeter:
    report-name: "Performance Test Run"