taurus-jmter.yml
execution:
  - executor: jmeter
    scenario: example-test
    concurrency: 10        
    ramp-up: 5s
    hold-for: 1m

scenarios:
  example-test:
    requests:
      - label: Home
        method: GET
        url: https://example.com

reporting:
  - module: console

settings:
  artifacts-dir: performance-results
  check-updates: false

modules:
  jmeter:
    path: /opt/jmeter
    version: 5.6.3

    properties:
      jmeter.save.saveservice.output_format: csv
      jmeter.save.saveservice.print_field_names: true