taurus-k6.yml
execution:
  - executor: k6
    concurrency: 10
    ramp-up: 30s
    hold-for: 1m
    iterations: 100
    scenario:
      script: k6/test.js

modules:
  k6:
    cmdline: "--out json=performance-results/test-results.json --summary-export=performance-results/summary.json --out web"

reporting:
  - module: passfail
    criteria:
      - avg-rt > 200ms for 10s
      - failures > 10% for 10s
      - errors > 5% for 10s

  - module: console

  - module: final-stats
    summary: true
    percentiles: true
    failed-label: false
    test-duration: true

  - module: junit-xml
    filename: performance-results/report.xml
    data-source: sample